# Presentación Pandas por Rumani

### ¿Qué es Pandas?
<br>
Pandas* es una biblioteca y herramienta potente de Python, Open Source, escrita como extensión de NumPy* para el tratamiento y análisis de datos.
<br><br>
Cómo característica distintiva ofrece estructura de datos y operaciones para manipular tablas numéricas y series temporales.
<br><br>
* Pandas: https://pandas.pydata.org/
<br>
* NumPy: https://numpy.org/

## Objetos básicos
<br>

En Pandas existen 3 tipos de objetos básicos:
* Series (1D)
* DataFrame (2D, tabla)
* Panels (3D)
<br>
<br>
Con el objeto de simplicar la presentación, se hará foco en el DataFrame, el cuál es el tipo de objeto básico utilizado principalmente de Pandas.

## El DataFrame
<br>
Definición: Un DataFrame es una estructura de datos tabular que se compone de filas y columnas ordenadas (una tabla).
<br><br>
Por cierto... un DataFrame no es más que un conjunto de Series que comparten el Index
<br><br>
El type de un DataFrame --> type(df) = pandas.core.frame.DataFrame
<br>
El type de una columna de un DataFrame --> type(df["name"]) = pandas.core.series.Series

# MANOS A LA OBRA...
<br><br>

### Instalación de la librería

`pip install pandas`

https://pypi.org/project/pandas/

In [3]:
# Importación de la librería
import pandas as pd

## Instanciación de un DataFrame

In [4]:
# Instanciación de un DataFrame vacío
df = pd.DataFrame()
type(df)

pandas.core.frame.DataFrame

In [5]:
# Instanciación de un DataFrame con columnas y datos e index específico
df_columns = ["id", "name", "lastname", "city", "tel_pre", "email"]
df_data =   [
            [1, "John", "Rambo", "Jungle", "+84", "greenbone@vietcong.com"],
            [2, "Rocky", "Balboa", "Philadelphia", "+1", "urssdown@adriana.com"],
            [3, "Cobra", "Cobretti", "Angeles", "+1", "international@right.com"], 
            [4, "Joseph", "Dredd", "Tierra", "+516684116547", "niunchance@apo.com"], 
            [5, "Lincoln", "Hawk", "Colorado", "+719", "am@am64.com"], 
            ]
df_index = ["A", "B", "C","D","E"]

In [6]:
df = pd.DataFrame(data=df_data, columns=df_columns, index=df_index )
df
# Si no se asgina un Index particular, pandas asigna uno por default comenzando desde 0

   id     name  lastname          city        tel_pre                    email
A   1     John     Rambo        Jungle            +84   greenbone@vietcong.com
B   2    Rocky    Balboa  Philadelphia             +1     urssdown@adriana.com
C   3    Cobra  Cobretti       Angeles             +1  international@right.com
D   4   Joseph     Dredd        Tierra  +516684116547       niunchance@apo.com
E   5  Lincoln      Hawk      Colorado           +719              am@am64.com

In [26]:
# Instanciación de un DataFrame con columnas y datos SIN index específico
df_columns = ["id", "name", "lastname", "city", "tel_pre", "email"]
df_data =   [
            [1, "John", "Rambo", "Jungle", "+84", "greenbone@vietcong.com"],
            [2, "Rocky", "Balboa", "Philadelphia", "+1", "urssdown@adriana.com"],
            [3, "Cobra", "Cobretti", "Angeles", "+1", "international@right.com"], 
            [4, "Joseph", "Dredd", "Tierra", "+516684116547", "niunchance@apo.com"], 
            [5, "Lincoln", "Hawk", "Colorado", "+719", "am@am64.com"], 
            ]

In [27]:
df = pd.DataFrame(data=df_data, columns=df_columns)
df
# Si no se asgina un Index particular, pandas asigna uno por default comenzando desde 0

   id     name  lastname          city        tel_pre                    email
0   1     John     Rambo        Jungle            +84   greenbone@vietcong.com
1   2    Rocky    Balboa  Philadelphia             +1     urssdown@adriana.com
2   3    Cobra  Cobretti       Angeles             +1  international@right.com
3   4   Joseph     Dredd        Tierra  +516684116547       niunchance@apo.com
4   5  Lincoln      Hawk      Colorado           +719              am@am64.com

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
type(df["name"]) #row siempre un index = 0 en el axis     y la columna el axis=1

pandas.core.series.Series

In [11]:
# Forma NO recomendada de seleccionar una columna.
# Se puede confundir con los métodos o funciones de pandas
df.name

0       John
1      Rocky
2      Cobra
3     Joseph
4    Lincoln
Name: name, dtype: object

## Selección de Columnas del DataFrame

In [12]:
# Forma SI recomendada de seleccionar una columna
df["name"]

0       John
1      Rocky
2      Cobra
3     Joseph
4    Lincoln
Name: name, dtype: object

In [13]:
df.columns

Index(['id', 'name', 'lastname', 'city', 'tel_pre', 'email'], dtype='object')

In [22]:
# Para seleccionar varias columnas se pasa una lista al DataFrame
df[["id","city","email"]]

   id          city                    email
0   1        Jungle   greenbone@vietcong.com
1   2  Philadelphia     urssdown@adriana.com
2   3       Angeles  international@right.com
3   4        Tierra       niunchance@apo.com
4   5      Colorado              am@am64.com

In [23]:
df

   id     name  lastname          city        tel_pre                    email
0   1     John     Rambo        Jungle            +84   greenbone@vietcong.com
1   2    Rocky    Balboa  Philadelphia             +1     urssdown@adriana.com
2   3    Cobra  Cobretti       Angeles             +1  international@right.com
3   4   Joseph     Dredd        Tierra  +516684116547       niunchance@apo.com
4   5  Lincoln      Hawk      Colorado           +719              am@am64.com

In [25]:
df = df[["id","city","email"]].copy()
df

   id          city                    email
0   1        Jungle   greenbone@vietcong.com
1   2  Philadelphia     urssdown@adriana.com
2   3       Angeles  international@right.com
3   4        Tierra       niunchance@apo.com
4   5      Colorado              am@am64.com

In [17]:
type(df[["id","city","email"]])    #df1 = df

pandas.core.frame.DataFrame

In [20]:
df1 = df[["id","city","email"]].copy()
df1

   id          city                    email
0   1        Jungle   greenbone@vietcong.com
1   2  Philadelphia     urssdown@adriana.com
2   3       Angeles  international@right.com
3   4        Tierra       niunchance@apo.com
4   5      Colorado              am@am64.com

In [28]:
df

   id     name  lastname          city        tel_pre                    email
0   1     John     Rambo        Jungle            +84   greenbone@vietcong.com
1   2    Rocky    Balboa  Philadelphia             +1     urssdown@adriana.com
2   3    Cobra  Cobretti       Angeles             +1  international@right.com
3   4   Joseph     Dredd        Tierra  +516684116547       niunchance@apo.com
4   5  Lincoln      Hawk      Colorado           +719              am@am64.com

## Asignación de una nueva columna al DataFrame

In [30]:
df.columns

Index(['id', 'name', 'lastname', 'city', 'tel_pre', 'email'], dtype='object')

In [29]:
df["name"]

0       John
1      Rocky
2      Cobra
3     Joseph
4    Lincoln
Name: name, dtype: object

In [31]:
# Forma incorrecta. Avisará con un "KeyError", informando que no la encuentra en el df.
df["new_column"]

KeyError: 'new_column'

In [32]:
# Forma correcta para asignar una nueva columna
df["new_column"] = "Nueva Data"
df

,id,name,lastname,city,tel_pre,email,new_column
0,1,John,Rambo,Jungle,+84,greenbone@vietcong.com,Nueva Data
1,2,Rocky,Balboa,Philadelphia,+1,urssdown@adriana.com,Nueva Data
2,3,Cobra,Cobretti,Angeles,+1,international@right.com,Nueva Data
3,4,Joseph,Dredd,Tierra,+516684116547,niunchance@apo.com,Nueva Data
4,5,Lincoln,Hawk,Colorado,+719,am@am64.com,Nueva Data

In [33]:
# Forma correcta para asignar una nueva columna o para "pisar" los datos de una ya existente
df["new_column"] = None
df

,id,name,lastname,city,tel_pre,email,new_column
0,1,John,Rambo,Jungle,+84,greenbone@vietcong.com,None
1,2,Rocky,Balboa,Philadelphia,+1,urssdown@adriana.com,None
2,3,Cobra,Cobretti,Angeles,+1,international@right.com,None
3,4,Joseph,Dredd,Tierra,+516684116547,niunchance@apo.com,None
4,5,Lincoln,Hawk,Colorado,+719,am@am64.com,None

In [36]:
df["full_name"] = df["name"] + " " + df["lastname"]
df

,id,name,lastname,city,tel_pre,email,new_column,full_name
0,1,John,Rambo,Jungle,+84,greenbone@vietcong.com,None,John Rambo
1,2,Rocky,Balboa,Philadelphia,+1,urssdown@adriana.com,None,Rocky Balboa
2,3,Cobra,Cobretti,Angeles,+1,international@right.com,None,Cobra Cobretti
3,4,Joseph,Dredd,Tierra,+516684116547,niunchance@apo.com,None,Joseph Dredd
4,5,Lincoln,Hawk,Colorado,+719,am@am64.com,None,Lincoln Hawk

## Eliminar columna en el DF

In [39]:
df.drop("new_column", axis=1, inplace=True)   # axis=0  es para los rows, indices
# parámetro axis=1 para indicar que se trata de una columna, 
# sino arrojará error no sabiendo si es index o columna. Además no hay index "new_column"
# el "axis" se hereda del array NumPy
#
# parámetro inplace=True, para que guarde el cambie en el DataFrame. 
# Por default está en False. Pandas lo hace para que no se pierda información de forma accidental
#df

In [40]:
df

,id,name,lastname,city,tel_pre,email,full_name
0,1,John,Rambo,Jungle,+84,greenbone@vietcong.com,John Rambo
1,2,Rocky,Balboa,Philadelphia,+1,urssdown@adriana.com,Rocky Balboa
2,3,Cobra,Cobretti,Angeles,+1,international@right.com,Cobra Cobretti
3,4,Joseph,Dredd,Tierra,+516684116547,niunchance@apo.com,Joseph Dredd
4,5,Lincoln,Hawk,Colorado,+719,am@am64.com,Lincoln Hawk

## Eliminar fila en el DF

In [41]:
# No hace falta especificar el axis=0, solo la fila según el index. 
# Y el inplace=True si se quiere guardar el cambio en el df
df.drop(1)  # por default siempre el axis=0
# regex notation

,id,name,lastname,city,tel_pre,email,full_name
0,1,John,Rambo,Jungle,+84,greenbone@vietcong.com,John Rambo
2,3,Cobra,Cobretti,Angeles,+1,international@right.com,Cobra Cobretti
3,4,Joseph,Dredd,Tierra,+516684116547,niunchance@apo.com,Joseph Dredd
4,5,Lincoln,Hawk,Colorado,+719,am@am64.com,Lincoln Hawk

In [43]:
df

,id,name,lastname,city,tel_pre,email,full_name
0,1,John,Rambo,Jungle,+84,greenbone@vietcong.com,John Rambo
1,2,Rocky,Balboa,Philadelphia,+1,urssdown@adriana.com,Rocky Balboa
2,3,Cobra,Cobretti,Angeles,+1,international@right.com,Cobra Cobretti
3,4,Joseph,Dredd,Tierra,+516684116547,niunchance@apo.com,Joseph Dredd
4,5,Lincoln,Hawk,Colorado,+719,am@am64.com,Lincoln Hawk

## Consultar dimensiones del DF

In [42]:
# sin ()
# tupla con las dimensiones
df.shape

(5, 7)

## Consultar columnas del DF

In [45]:
# sin ()
df.columns

Index(['id', 'name', 'lastname', 'city', 'tel_pre', 'email', 'full_name'], dtype='object')

## Consultar tipo de datos en columnas del DF

In [47]:
df["float_num"] = 3.5

In [48]:
df.dtypes

id             int64
name          object
lastname      object
city          object
tel_pre       object
email         object
full_name     object
float_num    float64
dtype: object

## Métodos .loc & .iloc

In [113]:
# Instanciación de un DataFrame con columnas y datos e index específico
df_columns = ["id", "name", "lastname", "city", "tel_pre", "email"]
df_data =   [
            [1, "John", "Rambo", "Jungle", "+84", "greenbone@vietcong.com"],
            [2, "Rocky", "Balboa", "Philadelphia", "+1", "urssdown@adriana.com"],
            [3, "Cobra", "Cobretti", "Angeles", "+1", "international@right.com"], 
            [4, "Joseph", "Dredd", "Tierra", "+516684116547", "niunchance@apo.com"], 
            [5, "Lincoln", "Hawk", "Colorado", "+719", "am@am64.com"], 
            ]
df_index = ["A", "B", "C","D","E"]
df = pd.DataFrame(data=df_data, columns=df_columns, index=df_index )
df

   id     name  lastname          city        tel_pre                    email
A   1     John     Rambo        Jungle            +84   greenbone@vietcong.com
B   2    Rocky    Balboa  Philadelphia             +1     urssdown@adriana.com
C   3    Cobra  Cobretti       Angeles             +1  international@right.com
D   4   Joseph     Dredd        Tierra  +516684116547       niunchance@apo.com
E   5  Lincoln      Hawk      Colorado           +719              am@am64.com

In [ ]:
# No solo las columnas son Series de Pandas, sino también las filas (rows)
type(df.loc["A"])

In [58]:
# Con .loc podemos referenciar un row a través del nombre de su index... 
# cuidado si el row tiene "nombre" ...
df.iloc[0][1]   # con iloc   solo con números de indices

'John'

In [66]:
df["city"]["A"]   # con loc puedo también con labels

'Jungle'

In [ ]:
# En cambio con .iloc podemos referenciar un row a través del nro de su index,
# más allá de su nombre

In [ ]:
df.iloc[0]

In [116]:
df.iloc[:,1]

A       John
B      Rocky
C      Cobra
D     Joseph
E    Lincoln
Name: name, dtype: object

In [ ]:
df[["email","name"]][["C","D"]]

In [136]:
df.loc[["C","D"],["email","name"]]

                     email    name
C  international@right.com   Cobra
D       niunchance@apo.com  Joseph

In [148]:
df.loc["A","name"] = "Juan"
df

,id,name,lastname,city,tel_pre,email
A,1,Juan,Rambo,Jungle,+84,greenbone@vietcong.com
B,2,Isaias,Balboa,Philadelphia,+1,urssdown@adriana.com
C,3,Isaias,Cobretti,Angeles,+1,international@right.com
D,4,Isaias,Dredd,Tierra,+516684116547,niunchance@apo.com
E,5,Isaias,Hawk,Colorado,+719,am@am64.com
name,Isaias,Isaias,Isaias,Isaias,Isaias,Isaias
0,NaN,Juan,NaN,NaN,NaN,NaN

In [151]:
df.loc["A"]["name"] = "Roberto"
df

,id,name,lastname,city,tel_pre,email
A,1,Roberto,Rambo,Jungle,+84,greenbone@vietcong.com
B,2,Isaias,Balboa,Philadelphia,+1,urssdown@adriana.com
C,3,Isaias,Cobretti,Angeles,+1,international@right.com
D,4,Isaias,Dredd,Tierra,+516684116547,niunchance@apo.com
E,5,Isaias,Hawk,Colorado,+719,am@am64.com
name,Isaias,Isaias,Isaias,Isaias,Isaias,Isaias
0,NaN,Juan,NaN,NaN,NaN,NaN

In [118]:
# Caso
df[["city", "name"]][0]

KeyError: 0

## Selección de Subsets de filas y columnas

In [68]:
df.loc[["C","D"],["id","name"]]

   id    name
C   3   Cobra
D   4  Joseph

NameError: name 'B' is not defined

In [85]:
df

   id     name  lastname          city        tel_pre                    email
A   1     John     Rambo        Jungle            +84   greenbone@vietcong.com
B   2    Rocky    Balboa  Philadelphia             +1     urssdown@adriana.com
C   3    Cobra  Cobretti       Angeles             +1  international@right.com
D   4   Joseph     Dredd        Tierra  +516684116547       niunchance@apo.com
E   5  Lincoln      Hawk      Colorado           +719              am@am64.com

In [86]:
df.drop("B", inplace=True)

In [87]:
df.reset_index(drop=True)

   id     name  lastname      city        tel_pre                    email
0   1     John     Rambo    Jungle            +84   greenbone@vietcong.com
1   3    Cobra  Cobretti   Angeles             +1  international@right.com
2   4   Joseph     Dredd    Tierra  +516684116547       niunchance@apo.com
3   5  Lincoln      Hawk  Colorado           +719              am@am64.com

## Reset del Index, muy útil

# Trabajo con Dataframes Numéricos

In [88]:
import numpy as np
from numpy.random import randn
np.random.seed(101)
df = pd.DataFrame(randn(5,5),["A","B","C","D","E"],["col_1","col_2","col_3","col_4","col_5"])
df

      col_1     col_2     col_3     col_4     col_5
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841

In [89]:
# Una descripción default rápida de pandas
df.describe()

          col_1     col_2     col_3     col_4     col_5
count  5.000000  5.000000  5.000000  5.000000  5.000000
mean   0.834813  0.215114  0.395060 -0.165273  0.201334
std    1.143221  1.016666  1.348430  1.795883  0.728930
min   -0.319318 -0.848077 -1.706086 -2.018168 -0.933237
25%    0.302665 -0.589001  0.188695 -1.159119 -0.134841
50%    0.528813  0.190794  0.605965 -0.758872  0.651118
75%    0.955057  0.628133  0.907969  0.503826  0.683509
max    2.706850  1.693723  1.978757  2.605967  0.740122

## Operaciones matemáticas

In [90]:
# suma de columnas específicas
df["sum_col"] = df["col_1"] + df["col_2"]
df

      col_1     col_2     col_3     col_4     col_5   sum_col
A  2.706850  0.628133  0.907969  0.503826  0.651118  3.334983
B -0.319318 -0.848077  0.605965 -2.018168  0.740122 -1.167395
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237 -0.060187
D  0.955057  0.190794  1.978757  2.605967  0.683509  1.145851
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841  1.996388

In [93]:
# suma de todas las columnas por fila
df["sum_col"] = df.sum(axis=1)
df

      col_1     col_2     col_3     col_4     col_5   sum_col
A  2.706850  0.628133  0.907969  0.503826  0.651118  5.397896
B -0.319318 -0.848077  0.605965 -2.018168  0.740122 -1.839476
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237 -1.563601
D  0.955057  0.190794  1.978757  2.605967  0.683509  6.414084
E  0.302665  1.693723 -1.706086 -1.159119 -0.134841 -1.003658

# Tratamiento con data faltante

In [102]:
d = {"A":[1,2,np.nan], "B":[5,np.nan,np.nan], "C":[1,2,3]}

In [103]:
# dict to pandas df
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [96]:
# eliminar nulos
df.dropna()

     A    B  C
0  1.0  5.0  1

In [98]:
#rellenar valores nulos para poder realizar operaciones
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [100]:
# rellenar con string
df.fillna("Fill value")

            A           B  C
0           1           5  1
1           2  Fill value  2
2  Fill value  Fill value  3

In [104]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [105]:
# rellenar una columna con el promedio
df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [106]:
df["B"].fillna(value=df["B"].mean())

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64

In [107]:
d = {"A":[1,2,np.nan], "B":[5,np.nan,np.nan], "C":[1,2,np.nan]}
# dict to pandas df
df = pd.DataFrame(d)
df

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  NaN

In [111]:
df

     A    B    C  col_sum  col_mean  col_max
0  1.0  5.0  1.0      7.0  3.500000      7.0
1  2.0  NaN  2.0      4.0  2.666667      4.0
2  NaN  NaN  NaN      0.0  0.000000      0.0

In [108]:
df["col_sum"] = df.sum(axis=1)
df

     A    B    C  col_sum
0  1.0  5.0  1.0      7.0
1  2.0  NaN  2.0      4.0
2  NaN  NaN  NaN      0.0

In [109]:
df["col_mean"] = df.mean(axis=1)
df

     A    B    C  col_sum  col_mean
0  1.0  5.0  1.0      7.0  3.500000
1  2.0  NaN  2.0      4.0  2.666667
2  NaN  NaN  NaN      0.0  0.000000

In [110]:
df["col_max"] = df.max(axis=1)
df

     A    B    C  col_sum  col_mean  col_max
0  1.0  5.0  1.0      7.0  3.500000      7.0
1  2.0  NaN  2.0      4.0  2.666667      4.0
2  NaN  NaN  NaN      0.0  0.000000      0.0

In [ ]:
.loc & iloc

# Agrupamiento - GROUP BY

In [ ]:
data =  {
        "person":["Juan","Pedro","Alberto","Jose","Carlos","Luis"],
        "company":["GOOG","GOOG","MSFT","MSFT","FB","FB"], 
        "sales":[2000,3500,2750,1250,850,5500]
        }

In [ ]:
df = pd.DataFrame(data)
df

In [ ]:
df.groupby("company")

In [ ]:
df_groupby_comp = df.groupby("company")
df_groupby_comp

In [ ]:
# solicito una agregación... ignora lo no númerico
df_groupby_comp.mean()

In [ ]:
df_groupby_comp.std()

In [ ]:
df_groupby_comp.sum()

In [ ]:
df_groupby_comp.sum().loc["FB"]

In [ ]:
df_groupby_comp.max()

In [ ]:
df_groupby_comp.min()

In [ ]:
df_groupby_comp.count()

In [ ]:
df_groupby_comp.count()

In [ ]:
df.groupby("company").describe()

In [ ]:
df.groupby("company").describe().transpose()

In [ ]:
df.groupby("company").describe().transpose()["GOOG"]

# Concatenación y Mergeo

In [2]:
import pandas as pd

## Concatenación

In [3]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [4]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [5]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [6]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [7]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

## Mergeo

In [8]:
df_left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
df_left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [9]:
df_right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})   
df_right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [10]:
# Parecido a los comandos PLSQL
pd.merge(df_left, df_right, how="inner", on="key")   
# how --> inner, right, left, outer
# on --> lista de claves, si son múltilples --> on=["key1", "key2"]

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

# Operaciones Varias con DataFrames (manejo)

In [ ]:
df = pd.DataFrame({
                    "col1":[1,2,3,4],
                    "col2":[444,555,666,444],
                    "col3":["abc","def","ghi","xyz"]
                  })
df

In [ ]:
# valores unicos para la columna 2
df["col2"].unique()

In [ ]:
# Cantidad de valores unicos para la columna 2
# len(df["col2"].unique())
df["col2"].nunique()

In [ ]:
# Cuenta Cantidad de valores unicos una columna
df["col2"].value_counts()

In [ ]:
# filtrado de DataFrames con condición
df[df["col1"]>2]

In [ ]:
# filtrado de DataFrames con varias condiciones
df[(df["col1"]>2) & (df["col2"]==444)]

# El poderoso método Apply()

In [ ]:
# imaginen una función
def dos_veces_2(x):
    return x*2

In [ ]:
# Pandas permite aplicarla al DataFrame a través de este método
df["col1"].apply(dos_veces_2)

In [ ]:
# Pandas también permite aplicar funciones de predeterminadas con apply()

df["col3"].apply(len)

## Es más poderoso aún cuando lo usamos con expresiones lambda

In [ ]:
df["col2"].apply(lambda x: x*2)

## Eliminar columnas y filas

In [ ]:
df.columns

In [ ]:
df.index

In [ ]:
df.drop("col1", axis=1)

In [ ]:
df.drop(1)

## Ordenar DataFrames

In [ ]:
df.sort_values(by="col2") # by puede no ir porque es el primer argumento esperado
# Observar como el índice sigue "pegado"

## Hallar celdas null de forma rápida

In [ ]:
df.isnull()

# Input & Output Data

### Input

In [ ]:
pwd

In [ ]:
pd.read_csv("pres_talpor.csv")

In [ ]:
df = pd.read_csv("pres_talpor.csv")

In [ ]:
# Diferentes tipos de lectura (json, clipboard, html, xlsx, sql)
pd.read_

### Output

In [ ]:
# si vuelvo a leer el output con read_csv voy a tener un nuevo index
df.to_csv("my_talpor_output.csv", index=False)

# SQL

In [11]:
from sqlalchemy import create_engine

In [12]:
# conn de db super liviano que está en memoria
conn = create_engine("sqlite:///:memory:")

In [13]:
df

NameError: name 'df' is not defined

In [14]:
# nombre_de_tabla, conector
df.to_sql("my_talpor_table", conn)

NameError: name 'df' is not defined

In [ ]:
df_sql  = pd.read_sql("my_talpor_table", conn)

In [ ]:
df_sql